In [1]:
import json
from sqlalchemy import create_engine
import pandas as pd 
import numpy as np

with open("sql_credentials.json") as file:
    data = json.load(file)
    myUser = data["user"]
    myPassword = data["password"]
    myHost = data["host"]

def connect_db(user, password, host, bd):
    s = "mysql+pymysql://"
    s += user+":"+password+"@"+host+"/"+bd
    return create_engine(s)

survey = connect_db(myUser,myPassword,myHost,"survey")

data = pd.read_excel("jeux_donnees/Data_Professional_Salary_Survey_Responses_1.xlsx")
data["HowManyCompanies"]=data["HowManyCompanies"].apply(str)

In [52]:
table_sondage = pd.read_sql_query("SELECT * FROM sondage", survey)
table_sondage["sdg_year"] = data["Survey Year"]
table_sondage.drop_duplicates(inplace=True)
table_sondage.to_sql('sondage', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from sondage", survey)

   sdg_id  sdg_year
0       1      2021
1       2      2020
2       3      2019
3       4      2018
4       5      2017

In [54]:
table_country = pd.read_sql_query("SELECT * FROM country", survey)
table_country[table_country.columns[1]] = data["Country"]
table_country.drop_duplicates(inplace=True)
table_country.to_sql('country', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from country", survey)

IntegrityError: (pymysql.err.IntegrityError) (1062, "Duplicate entry '1' for key 'PRIMARY'")
[SQL: INSERT INTO country (ctr_id, ctr_name) VALUES (%(ctr_id)s, %(ctr_name)s)]
[parameters: ({'ctr_id': 1, 'ctr_name': 'Sweden'}, {'ctr_id': 2, 'ctr_name': 'United States'}, {'ctr_id': 3, 'ctr_name': 'United States'}, {'ctr_id': 4, 'ctr_name': 'United Kingdom'}, {'ctr_id': 5, 'ctr_name': 'United States'}, {'ctr_id': 6, 'ctr_name': 'Pakistan'}, {'ctr_id': 7, 'ctr_name': 'United States'}, {'ctr_id': 8, 'ctr_name': 'United States'}  ... displaying 10 of 97 total bound parameter sets ...  {'ctr_id': 96, 'ctr_name': 'United States'}, {'ctr_id': 97, 'ctr_name': 'United States'})]
(Background on this error at: http://sqlalche.me/e/13/gkpj)

In [55]:
pd.read_sql_query("select * from country", survey)

    ctr_id        ctr_name
0        1          Sweden
1        2   United States
2        3  United Kingdom
3        4        Pakistan
4        5        Paraguay
..     ...             ...
92      93         Albania
93      94         Bolivia
94      95         Vietnam
95      96         Bermuda
96      97           Kenya

[97 rows x 2 columns]

In [66]:
table_looking_job = pd.read_sql_query("SELECT * FROM looking_job", survey)
table_looking_job[table_looking_job.columns[1]] = data["LookingForAnotherJob"]
table_looking_job.drop_duplicates(inplace=True)

table_looking_job = table_looking_job[table_looking_job[table_looking_job.columns[1]] != "Not Asked"]

table_looking_job.to_sql('looking_job', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from looking_job", survey)

<ipython-input-66-90f81341a6b7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  table_looking_job[table_looking_job.columns[1]] = data["LookingForAnotherJob"]
<ipython-input-66-90f81341a6b7>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  table_looking_job.drop_duplicates(inplace=True)

   look_id                                  look_job
0        1                                        No
1        2    Yes, but only passively (just curious)
2        3  Yes, actively looking for something else

In [69]:
table_education = pd.read_sql_query("SELECT * FROM education", survey)
table_education[table_education.columns[1]] = data["Education"]
table_education.drop_duplicates(inplace=True)

table_education = table_education[table_education[table_education.columns[1]] != "Not Asked"]

table_education.to_sql('education', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from education", survey)

   look_id                                  look_job
0        1                                        No
1        2    Yes, but only passively (just curious)
2        3  Yes, actively looking for something else

In [70]:
pd.read_sql_query("select * from education", survey)

   edu_id                   edu_title
0       1         Bachelors (4 years)
1       2  None (no degree completed)
2       3                     Masters
3       4        Associates (2 years)
4       5               Doctorate/PhD

In [82]:
table_largest_city = pd.read_sql_query("SELECT * FROM largest_city", survey)
table_largest_city[table_largest_city.columns[1]] = data["PopulationOfLargestCityWithin20Miles"]
table_largest_city.drop_duplicates(inplace=True)

table_largest_city = table_largest_city[table_largest_city[table_largest_city.columns[1]] != "Not Asked"]

table_largest_city.to_sql('largest_city', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from largest_city", survey)

   pop_id              pop_name
0       1      <= 20,000 (town)
1       2      1M+ (metropolis)
2       3  300K-1M (large city)
3       4      100K-299K (city)
4       5  20K-99K (large town)

In [83]:
table_how_many_companies = pd.read_sql_query("SELECT * FROM how_many_companies", survey)
table_how_many_companies[table_how_many_companies.columns[1]] = data["HowManyCompanies"]
table_how_many_companies.drop_duplicates(inplace=True)

table_how_many_companies = table_how_many_companies[table_how_many_companies[table_how_many_companies.columns[1]] != "Not Asked"]

table_how_many_companies.to_sql('how_many_companies', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from how_many_companies", survey)

   mcp_id                                 mcp_many_companies
0       1  1 (this is the only company where I've had thi...
1       2                                                  5
2       3                                                  4
3       4  2 (I worked at another similar position elsewh...
4       5                                                  3
5       6                                          6 or more

In [90]:
table_employment_status = pd.read_sql_query("SELECT * FROM employment_status", survey)
table_employment_status[table_employment_status.columns[1]] = data["EmploymentStatus"]
table_employment_status.drop_duplicates(inplace=True)

table_employment_status = table_employment_status[table_employment_status[table_employment_status.columns[1]] != "Not Asked"]

table_employment_status.to_sql('employment_status', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from employment_status", survey)

   emp_id                                         emp_status
0       1                                 Full time employee
1       2  Full time employee of a consulting/contracting...
2       3  Independent consultant, contractor, freelancer...
3       4                                          Part time
4       5         Independent or freelancer or company owner

In [92]:
column_employment_sector = pd.read_sql_query("select * from employment_sector", survey).columns
column_employment_sector

employment_sector = pd.DataFrame(columns = column_employment_sector)
employment_sector['sec_name'] = data['EmploymentSector']
employment_sector.drop_duplicates(inplace=True)

employment_sector.to_sql('employment_sector', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from employment_sector", survey)

   sec_id                               sec_name
0       1                       Private business
1       2  Education (K-12, college, university)
2       3              State/province government
3       4                       Local government
4       5                             Non-profit
5       6                     Federal government
6       7                                Student

In [193]:
column_certification = pd.read_sql_query("select * from certification limit 1", survey).columns
column_certification

data_certification_sans_asked = data[data["Certifications"] != "Not Asked"]
certification = pd.DataFrame(columns = column_certification)
certification['cert_name'] = data_certification_sans_asked['Certifications']
certification.drop_duplicates(inplace=True)

certification.to_sql('certification', if_exists='append', con=survey, index=False)

pd.read_sql_query("SELECT * FROM certification", survey)

   cert_id                         cert_name
0        7                  No, I never have
1        8  Yes, and they're currently valid
2        9             Yes, but they expired

In [104]:
table_career_plan = pd.read_sql_query("SELECT * FROM carreer_plan", survey)
table_career_plan[table_career_plan.columns[1]] = data["CareerPlansThisYear"]
table_career_plan.drop_duplicates(inplace=True)

table_career_plan = table_career_plan[table_career_plan[table_career_plan.columns[1]] != "Not Asked"]

table_career_plan.to_sql('carreer_plan', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from carreer_plan", survey)

   cap_id                                        cap_plan
0       1          Stay with the same employer, same role
1       2                               Prefer not to say
2       3                 Change both employers and roles
3       4   Stay with the same role, but change employers
4       5  Stay with the same employer,  but change roles

In [11]:
table_job = pd.read_sql_query("SELECT * FROM job", survey)
table_job[table_job.columns[1]] = data["JobTitle"]
table_job.drop_duplicates(inplace=True)

table_job = table_job[table_job[table_job.columns[1]] != "Not Asked"]

table_job.to_sql('job', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from job", survey)

    job_id                                           job_name
0       24  Developer: Business Intelligence (SSRS, PowerB...
1       25  DBA (Production Focus - build & troubleshoot s...
2       26  DBA (General - splits time evenly between writ...
3       27                                            Manager
4       28                  Developer: App code (C#, JS, etc)
5       29                                   Developer: T-SQL
6       30                                          Architect
7       31  DBA (Development Focus - tunes queries, indexe...
8       32                                           Engineer
9       33                                            Analyst
10      34                                              Other
11      35                                     Data Scientist
12      36                                                DBA
13      37                        Principal database engineer
14      38                   DevOps, Sr Software Engineer DBA
15      39                                        Technician
16      40                                Database Specialist
17      41                                         Consultant
18      42                              Systems Administrator
19      43                                              Sales
20      44                                 DBA / BI Developer
21      45                                     Sr Consultant
22      46                               Analytics consultant

In [16]:
table_database = pd.read_sql_query("SELECT * FROM db", survey)
table_database[table_database.columns[1]] = data["PrimaryDatabase"]
table_database.drop_duplicates(inplace=True)

table_database = table_database[table_database[table_database.columns[1]] != "Not Asked"]

table_database

table_database.to_sql('db', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from db", survey)

    db_id                  db_name
0       1     Microsoft SQL Server
1       2               PostgreSQL
2       3                    Other
3       4             Azure SQL DB
4       5         Microsoft Access
5       6                   Oracle
6       7            MySQL/MariaDB
7       8  Amazon RDS (any flavor)
8       9                  MongoDB
9      10                      DB2
10     11                Cassandra
11     12                   SQLite
12     13                      SAP
13     14                 Teradata
14     15            Elasticsearch

In [33]:
table_task = pd.read_sql_query("SELECT * FROM task", survey)
table_task[table_task.columns[1]] = data["KindsOfTasksPerformed"]
table_task.drop_duplicates(inplace=True)

table_task = table_task[table_task[table_task.columns[1]] != "Not Asked"]

a = table_task[table_task.columns[1]].tolist()
s = ', '.join(map(str,a))

l=s.split(", ")

ld = pd.DataFrame(l)
ld.drop_duplicates(inplace=True)

ld = ld[ld[ld.columns[0]] != "nan" ]

table_task = pd.read_sql_query("SELECT * FROM task", survey) # Re dÃ©finition de table_task
table_task["tas_name"]=ld[0]

table_task.to_sql('task', if_exists='append', con=survey, index=False)

pd.read_sql_query("select * from task", survey)

   tas_id                          tas_name
0       1                      Manual tasks
1       2             Meetings & management
2       3                          Projects
3       4  Build scripts & automation tools
4       5                  On-call 24/7/365
5       6                               R&D
6       7     On-call as part of a rotation
7       8                 Training/teaching

In [148]:
table_sondage_item = pd.read_sql_query("SELECT * FROM sondage_item", survey)
table_sondage_item

Empty DataFrame
Columns: [sgi_id, timestamp, salary_usd, postal_code, years_with_db, manage_staff, years_with_job, other_people, company_employee, database_servers, eduction_computer, hours_worked, telecommute, newest_version, oldest_version, gender, sdg_id, ctr_id, primary_db_id, emp_id, job_id, mcp_id, edu_id, cert_id, pop_id, sec_id, look_id, cap_id]
Index: []

[0 rows x 28 columns]

In [66]:
table_database = pd.read_sql_query("SELECT * FROM db", survey)

In [68]:
int(table_database[table_database.columns[0]][(table_database[table_database.columns[1]]=="Other")==True])

3

In [195]:
pd.options.mode.chained_assignment = None

table_sondage_item = pd.read_sql_query("SELECT * FROM sondage_item", survey)
table_sondage_item

dic = {
    'timestamp':'Timestamp',
    'salary_usd':'SalaryUSD',
    'postal_code':'PostalCode',
    'years_with_db':'YearsWithThisDatabase',
    'manage_staff':'ManageStaff',
    'years_with_job':'YearsWithThisTypeOfJob',
    'other_people':'OtherPeopleOnYourTeam',
    'company_employee':'CompanyEmployeesOverall',
    'database_servers':'DatabaseServers',
    'eduction_computer':'EducationIsComputerRelated',
    'hours_worked':'HoursWorkedPerWeek',
    'telecommute':'TelecommuteDaysPerWeek',
    'newest_version':'NewestVersionInProduction',
    'oldest_version':'OldestVersionInProduction',
    'gender':'Gender',
    "sdg_id":"Survey Year",
    "sec_id":"EmploymentSector",
    "look_id":"LookingForAnotherJob",
    "cap_id":"CareerPlansThisYear",
    "ctr_id":"Country",
    "primary_db_id":"PrimaryDatabase",
    "emp_id":"EmploymentStatus",
    "job_id":"JobTitle",
    "mcp_id":"HowManyCompanies",
    "edu_id":"Education",
    "cert_id":"Certifications",
    "pop_id":"PopulationOfLargestCityWithin20Miles"
    }

dic_df = {}

dic_df["sdg_id"] = pd.read_sql_query("SELECT * FROM sondage", survey)
dic_df["sec_id"] = pd.read_sql_query("SELECT * FROM employment_sector", survey)
dic_df["look_id"] = pd.read_sql_query("SELECT * FROM looking_job", survey)
dic_df["cap_id"] = pd.read_sql_query("SELECT * FROM carreer_plan", survey)
dic_df["ctr_id"] = pd.read_sql_query("SELECT * FROM country", survey)
dic_df["primary_db_id"] = pd.read_sql_query("SELECT * FROM db", survey)
dic_df["emp_id"] = pd.read_sql_query("SELECT * FROM employment_status", survey)
dic_df["job_id"] = pd.read_sql_query("SELECT * FROM job", survey)
dic_df["mcp_id"] = pd.read_sql_query("SELECT * FROM how_many_companies", survey)
dic_df["edu_id"] = pd.read_sql_query("SELECT * FROM education", survey)
dic_df["cert_id"] = pd.read_sql_query("SELECT * FROM certification", survey)
dic_df["pop_id"] = pd.read_sql_query("SELECT * FROM largest_city", survey)

import functools

def trouver_index(valeur, table):
    return int(table[table.columns[0]][(table[table.columns[1]]==valeur)==True])

for cle,colonne in dic.items():
    print(colonne)
    if cle[-2:]=="id":
        for i in data[colonne].index:
            if data[colonne][i] == "Not Asked" :
                table_sondage_item[cle][i] = "Not Asked"
            else:
                table_sondage_item[cle][i] = trouver_index(data[colonne][i], dic_df[cle])
    else:
        table_sondage_item[cle]=data[colonne]

Timestamp
SalaryUSD
PostalCode
YearsWithThisDatabase
ManageStaff
YearsWithThisTypeOfJob
OtherPeopleOnYourTeam
CompanyEmployeesOverall
DatabaseServers
EducationIsComputerRelated
HoursWorkedPerWeek
TelecommuteDaysPerWeek
NewestVersionInProduction
OldestVersionInProduction
Gender
Survey Year
EmploymentSector
LookingForAnotherJob
CareerPlansThisYear
Country
PrimaryDatabase
EmploymentStatus
JobTitle
HowManyCompanies
Education
Certifications
PopulationOfLargestCityWithin20Miles

In [196]:
table_sondage_item

,sgi_id,timestamp,salary_usd,postal_code,years_with_db,manage_staff,years_with_job,other_people,company_employee,database_servers,...,primary_db_id,emp_id,job_id,mcp_id,edu_id,cert_id,pop_id,sec_id,look_id,cap_id
0,NaN,2020-12-10 08:22:42.696,65000.0,NaN,4,Yes,4,None,2,Not Asked,...,1,1,24,1,Not Asked,Not Asked,1,1,Not Asked,1
1,NaN,2020-12-10 08:23:22.242,145000.0,76063,15,No,25,None,74,Not Asked,...,1,1,25,2,Not Asked,Not Asked,2,1,Not Asked,1
2,NaN,2020-12-10 08:23:37.909,105000.0,43240,12,Yes,6,1,500,Not Asked,...,1,1,26,3,Not Asked,Not Asked,3,1,Not Asked,1
3,NaN,2020-12-10 08:23:48.152,46482.0,NaN,10,No,5,None,35,Not Asked,...,1,1,25,4,Not Asked,Not Asked,3,2,Not Asked,1
4,NaN,2020-12-10 08:24:03.600,98800.0,468,5,No,5,None,50,Not Asked,...,1,1,24,1,Not Asked,Not Asked,4,1,Not Asked,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10336,NaN,2017-01-14 15:50:23.936,36549.0,Not Asked,3,No,1,1,Not Asked,42,...,1,1,36,Not Asked,2,7,Not Asked,1,1,Not Asked
10337,NaN,2017-01-15 01:01:21.212,65000.0,Not Asked,7,Yes,3,5,Not Asked,40,...,1,1,36,Not Asked,1,7,Not Asked,1,2,Not Asked
10338,NaN,2017-01-15 03:25:47.422,85000.0,Not Asked,17,No,17,1,Not Asked,200,...,1,1,34,Not Asked,1,7,Not Asked,1,2,Not Asked
10339,NaN,2017-01-15 03:37:35.305,90000.0,Not Asked,8,No,3,1,Not Asked,80,...,1,1,36,Not Asked,3,8,Not Asked,1,3,Not Asked
10340,NaN,2017-01-15 03:37:59.149,23000.0,Not Asked,4,No,9,3,Not Asked,10,...,1,1,30,Not Asked,2,8,Not Asked,1,2,Not Asked

In [205]:
table_sondage_item = table_sondage_item.replace("Not Asked",np.nan)
table_sondage_item

,sgi_id,timestamp,salary_usd,postal_code,years_with_db,manage_staff,years_with_job,other_people,company_employee,database_servers,...,primary_db_id,emp_id,job_id,mcp_id,edu_id,cert_id,pop_id,sec_id,look_id,cap_id
0,NaN,2020-12-10 08:22:42.696,65000.0,NaN,4,Yes,4,None,2,NaN,...,1,1,24,1.0,NaN,NaN,1.0,1,NaN,1.0
1,NaN,2020-12-10 08:23:22.242,145000.0,76063,15,No,25,None,74,NaN,...,1,1,25,2.0,NaN,NaN,2.0,1,NaN,1.0
2,NaN,2020-12-10 08:23:37.909,105000.0,43240,12,Yes,6,1,500,NaN,...,1,1,26,3.0,NaN,NaN,3.0,1,NaN,1.0
3,NaN,2020-12-10 08:23:48.152,46482.0,NaN,10,No,5,None,35,NaN,...,1,1,25,4.0,NaN,NaN,3.0,2,NaN,1.0
4,NaN,2020-12-10 08:24:03.600,98800.0,468,5,No,5,None,50,NaN,...,1,1,24,1.0,NaN,NaN,4.0,1,NaN,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10336,NaN,2017-01-14 15:50:23.936,36549.0,NaN,3,No,1,1,NaN,42.0,...,1,1,36,NaN,2.0,7.0,NaN,1,1.0,NaN
10337,NaN,2017-01-15 01:01:21.212,65000.0,NaN,7,Yes,3,5,NaN,40.0,...,1,1,36,NaN,1.0,7.0,NaN,1,2.0,NaN
10338,NaN,2017-01-15 03:25:47.422,85000.0,NaN,17,No,17,1,NaN,200.0,...,1,1,34,NaN,1.0,7.0,NaN,1,2.0,NaN
10339,NaN,2017-01-15 03:37:35.305,90000.0,NaN,8,No,3,1,NaN,80.0,...,1,1,36,NaN,3.0,8.0,NaN,1,3.0,NaN
10340,NaN,2017-01-15 03:37:59.149,23000.0,NaN,4,No,9,3,NaN,10.0,...,1,1,30,NaN,2.0,8.0,NaN,1,2.0,NaN

In [212]:
table_sondage_item["manage_staff"] = table_sondage_item["manage_staff"].replace("Yes",1)
table_sondage_item["manage_staff"] = table_sondage_item["manage_staff"].replace("No",0)

table_sondage_item["eduction_computer"]  = table_sondage_item["eduction_computer"].replace("Yes",int(1))
table_sondage_item["eduction_computer"] = table_sondage_item["eduction_computer"].replace("No",int(0))
table_sondage_item["eduction_computer"]

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
10336    NaN
10337    1.0
10338    0.0
10339    1.0
10340    1.0
Name: eduction_computer, Length: 10341, dtype: float64

In [216]:
table_sondage_item["other_people"]  = table_sondage_item["other_people"].replace(0,"None")
table_sondage_item["other_people"]

0        None
1        None
2           1
3        None
4        None
         ...
10336       1
10337       5
10338       1
10339       1
10340       3
Name: other_people, Length: 10341, dtype: object

In [229]:
table_sondage_item["telecommute"] = table_sondage_item["telecommute"].replace("None, or less than 1 day per week",0)
table_sondage_item["telecommute"] = table_sondage_item["telecommute"].replace("5 or more",5)
table_sondage_item["telecommute"]

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
10336    0.0
10337    1.0
10338    1.0
10339    5.0
10340    0.0
Name: telecommute, Length: 10341, dtype: float64

In [232]:
table_sondage_item.to_sql('sondage_item', if_exists='append', con=survey, index=False)

In [233]:
pd.read_sql_query("SELECT * FROM sondage_item", survey)

,sgi_id,timestamp,salary_usd,postal_code,years_with_db,manage_staff,years_with_job,other_people,company_employee,database_servers,...,primary_db_id,emp_id,job_id,mcp_id,edu_id,cert_id,pop_id,sec_id,look_id,cap_id
0,44938,2020-12-10 08:22:43,65000.0,None,4,1,4,None,2,NaN,...,1,1,24,1.0,NaN,NaN,1.0,1,NaN,1.0
1,44939,2020-12-10 08:23:22,145000.0,76063,15,0,25,None,74,NaN,...,1,1,25,2.0,NaN,NaN,2.0,1,NaN,1.0
2,44940,2020-12-10 08:23:38,105000.0,43240,12,1,6,1,500,NaN,...,1,1,26,3.0,NaN,NaN,3.0,1,NaN,1.0
3,44941,2020-12-10 08:23:48,46482.0,None,10,0,5,None,35,NaN,...,1,1,25,4.0,NaN,NaN,3.0,2,NaN,1.0
4,44942,2020-12-10 08:24:04,98800.0,468,5,0,5,None,50,NaN,...,1,1,24,1.0,NaN,NaN,4.0,1,NaN,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10336,55274,2017-01-14 15:50:24,36549.0,None,3,0,1,1,None,42.0,...,1,1,36,NaN,2.0,7.0,NaN,1,1.0,NaN
10337,55275,2017-01-15 01:01:21,65000.0,None,7,1,3,5,None,40.0,...,1,1,36,NaN,1.0,7.0,NaN,1,2.0,NaN
10338,55276,2017-01-15 03:25:47,85000.0,None,17,0,17,1,None,200.0,...,1,1,34,NaN,1.0,7.0,NaN,1,2.0,NaN
10339,55277,2017-01-15 03:37:35,90000.0,None,8,0,3,1,None,80.0,...,1,1,36,NaN,3.0,8.0,NaN,1,3.0,NaN
10340,55278,2017-01-15 03:37:59,23000.0,None,4,0,9,3,None,10.0,...,1,1,30,NaN,2.0,8.0,NaN,1,2.0,NaN

In [2]:
data

,Survey Year,Timestamp,SalaryUSD,Country,PostalCode,PrimaryDatabase,YearsWithThisDatabase,OtherDatabases,EmploymentStatus,JobTitle,...,NewestVersionInProduction,OldestVersionInProduction,PopulationOfLargestCityWithin20Miles,EmploymentSector,LookingForAnotherJob,CareerPlansThisYear,Gender,OtherJobDuties,KindsOfTasksPerformed,Counter
0,2021,2020-12-10 08:22:42.696,65000.0,Sweden,NaN,Microsoft SQL Server,4,Microsoft SQL Server,Full time employee,"Developer: Business Intelligence (SSRS, PowerB...",...,SQL Server 2016,SQL Server 2016,"<= 20,000 (town)",Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1
1,2021,2020-12-10 08:23:22.242,145000.0,United States,76063,Microsoft SQL Server,15,Azure SQL DB (any flavor),Full time employee,DBA (Production Focus - build & troubleshoot s...,...,SQL Server 2019,SQL Server 2014,1M+ (metropolis),Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1
2,2021,2020-12-10 08:23:37.909,105000.0,United States,43240,Microsoft SQL Server,12,"PostgreSQL, Azure SQL DB (any flavor)",Full time employee,DBA (General - splits time evenly between writ...,...,SQL Server 2017,SQL Server 2008R2,300K-1M (large city),Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1
3,2021,2020-12-10 08:23:48.152,46482.0,United Kingdom,NaN,Microsoft SQL Server,10,Azure SQL DB (any flavor),Full time employee,DBA (Production Focus - build & troubleshoot s...,...,SQL Server 2019,SQL Server 2012,300K-1M (large city),"Education (K-12, college, university)",Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1
4,2021,2020-12-10 08:24:03.600,98800.0,United States,468,Microsoft SQL Server,5,DB2,Full time employee,"Developer: Business Intelligence (SSRS, PowerB...",...,SQL Server 2019,SQL Server 2012,100K-299K (city),Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10336,2017,2017-01-14 15:50:23.936,36549.0,United Kingdom,Not Asked,Microsoft SQL Server,3,NaN,Full time employee,DBA,...,Not Asked,Not Asked,Not Asked,Private business,No,Not Asked,Not Asked,Not Asked,Not Asked,1
10337,2017,2017-01-15 01:01:21.212,65000.0,Saudi Arabia,Not Asked,Microsoft SQL Server,7,"Oracle, MySQL/MariaDB, Microsoft Access, SQLite",Full time employee,DBA,...,Not Asked,Not Asked,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1
10338,2017,2017-01-15 03:25:47.422,85000.0,Netherlands,Not Asked,Microsoft SQL Server,17,Oracle,Full time employee,Other,...,Not Asked,Not Asked,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1
10339,2017,2017-01-15 03:37:35.305,90000.0,United States,Not Asked,Microsoft SQL Server,8,MySQL/MariaDB,Full time employee,DBA,...,Not Asked,Not Asked,Not Asked,Private business,"Yes, actively looking for something else",Not Asked,Not Asked,Not Asked,Not Asked,1
10340,2017,2017-01-15 03:37:59.149,23000.0,Portugal,Not Asked,Microsoft SQL Server,4,"PostgreSQL, DB2, Microsoft Access",Full time employee,Architect,...,Not Asked,Not Asked,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1

# Tables d'associations

Kinds of tasks performed

Other duties

Other databases

## 1. Taks performed

In [2]:
data["KindsOfTasksPerformed"][4323]

'Build scripts & automation tools, Manual tasks, On-call 24/7/365'

In [3]:
data = pd.read_excel("jeux_donnees/Data_Professional_Salary_Survey_Responses_1.xlsx")
data["HowManyCompanies"]=data["HowManyCompanies"].apply(str)

sondage_item = pd.read_sql_query("SELECT * FROM sondage_item", survey)
task = pd.read_sql_query("SELECT * FROM task", survey)

In [4]:
task

   tas_id                          tas_name
0       1                      Manual tasks
1       2             Meetings & management
2       3                          Projects
3       4  Build scripts & automation tools
4       5                  On-call 24/7/365
5       6                               R&D
6       7     On-call as part of a rotation
7       8                 Training/teaching

In [6]:
pd.options.mode.chained_assignment = None

def trouver_index(valeur, table):
    return int(table[table.columns[0]][(table[table.columns[1]]==valeur)==True])

l=[]
for i in range(len(sondage_item)):
    if type(data["KindsOfTasksPerformed"][i]) != str :
        l.append(["Not Asked"])
    else :
        l.append(data["KindsOfTasksPerformed"][i].split(", ")) 

liste_sgi_id = []
liste_tasks = []

for i in range(len(l)):
    for j in l[i] :
        liste_sgi_id.append(sondage_item["sgi_id"][i])
        liste_tasks.append(j)

df_task_performed = pd.DataFrame()
df_task_performed["sgi_id"] = liste_sgi_id
df_task_performed["tas_id"] = liste_tasks

for i in df_task_performed.index:
    if df_task_performed["tas_id"][i] == "Not Asked" :
        df_task_performed = df_task_performed.drop([i])
    else:
        df_task_performed["tas_id"][i] = trouver_index(df_task_performed["tas_id"][i], task)

In [11]:
df_task_performed

       sgi_id tas_id
3470    48408      1
3471    48408      2
3472    48408      3
3473    48409      4
3474    48409      1
...       ...    ...
19051   52379      3
19052   52379      8
19053   52380      2
19054   52380      5
19055   52380      3

[15381 rows x 2 columns]

In [73]:
df_task_performed.to_sql('task_performed', if_exists='append', con=survey, index=False)

## 2. Other duties

In [5]:
data = pd.read_excel("jeux_donnees/Data_Professional_Salary_Survey_Responses_1.xlsx")
data["HowManyCompanies"]=data["HowManyCompanies"].apply(str)

sondage_item = pd.read_sql_query("SELECT * FROM sondage_item", survey)
job = pd.read_sql_query("SELECT * FROM job", survey)

job.index = job['job_name'].str.len()
job = job.sort_index(ascending=False).reset_index(drop=True)
job

    job_id                                           job_name
0       26  DBA (General - splits time evenly between writ...
1       31  DBA (Development Focus - tunes queries, indexe...
2       25  DBA (Production Focus - build & troubleshoot s...
3       24  Developer: Business Intelligence (SSRS, PowerB...
4       28                  Developer: App code (C#, JS, etc)
5       38                   DevOps, Sr Software Engineer DBA
6       37                        Principal database engineer
7       42                              Systems Administrator
8       46                               Analytics consultant
9       40                                Database Specialist
10      44                                 DBA / BI Developer
11      29                                   Developer: T-SQL
12      45                                     Sr Consultant
13      35                                     Data Scientist
14      39                                        Technician
15      41                                         Consultant
16      30                                          Architect
17      32                                           Engineer
18      33                                            Analyst
19      27                                            Manager
20      34                                              Other
21      43                                              Sales
22      36                                                DBA

In [6]:
pd.options.mode.chained_assignment = None

def trouver_index(valeur, table):
    return int(table[table.columns[0]][(table[table.columns[1]]==valeur)==True])

l=[]

for i in range(len(sondage_item)):
    if type(data["OtherJobDuties"][i]) != str :
        l.append(["Not Asked"])
    else :
        ljob=[]
        for j in job["job_name"]:
            if j in data["OtherJobDuties"][i]:
                ljob.append(j)
                data["OtherJobDuties"][i] = data["OtherJobDuties"][i].replace(j," ")
        l.append(ljob)

liste_sgi_id = []
liste_jobs = []

for i in range(len(l)):
    for j in l[i] :
        liste_sgi_id.append(sondage_item["sgi_id"][i])
        liste_jobs.append(j)

df_other_duties = pd.DataFrame()
df_other_duties["sgi_id"] = liste_sgi_id
df_other_duties["job_id"] = liste_jobs

for i in df_other_duties.index:
    if df_other_duties["job_id"][i] == "Not Asked" :
        df_other_duties = df_other_duties.drop([i])
    else:
        df_other_duties["job_id"][i] = trouver_index(df_other_duties["job_id"][i], job)

In [7]:
df_other_duties.to_sql('other_duties', if_exists='append', con=survey, index=False)

## 3. Other databases

In [2]:
sondage_item = pd.read_sql_query("SELECT * FROM sondage_item", survey)
db = pd.read_sql_query("SELECT * FROM db", survey)
db

    db_id                  db_name
0       1     Microsoft SQL Server
1       2               PostgreSQL
2       3                    Other
3       4             Azure SQL DB
4       5         Microsoft Access
5       6                   Oracle
6       7            MySQL/MariaDB
7       8  Amazon RDS (any flavor)
8       9                  MongoDB
9      10                      DB2
10     11                Cassandra
11     12                   SQLite
12     13                      SAP
13     14                 Teradata
14     15            Elasticsearch

In [3]:
pd.options.mode.chained_assignment = None

def trouver_index(valeur, table):
    return int(table[table.columns[0]][(table[table.columns[1]]==valeur)==True])

l=[]

for i in range(len(sondage_item)):
    if type(data["OtherDatabases"][i]) != str :
        l.append(["Not Asked"])
    elif ", " in data["OtherDatabases"][i]:
        l.append(data["OtherDatabases"][i].split(", "))
    else :
        l.append([data["OtherDatabases"][i]])

liste_sgi_id = []
liste_dbs = []

for i in range(len(l)):
    for j in l[i] :
        liste_sgi_id.append(sondage_item["sgi_id"][i])
        liste_dbs.append(j)

df_other_databases = pd.DataFrame()
df_other_databases["sgi_id"] = liste_sgi_id
df_other_databases["db_id"] = liste_dbs

a = df_other_databases["db_id"].drop_duplicates().to_list()


a.pop(9)
a.pop(124)
a.pop(21)
a[109] = "Elasticsearch (not a database, so much so an indexing engine)"
a.pop(110)
a[255] = 'SAP HANA (yep, "SAP" doesnt tell it enough)'
a.pop(256)
a[389] = "progress"
a[390] = "informix"
b = a.copy()
a.sort(key=len,reverse=True)

for i in range(len(a)):
    if a[i][0]==" ":
        a[i]=a[i][1:]
    if a[i][-1]==" ":
        a[i]=a[i][:-1]

In [4]:
new_dbs = list(set(a.copy()))
new_dbs.sort(key=len,reverse=True)

old_dbs = pd.read_sql_query("SELECT * FROM db",survey)
old_dbs = old_dbs["db_name"].to_list()

for old_db in old_dbs:
    if old_db in new_dbs :
        new_dbs.remove(old_db)

new_dbs

['foxpro developer with c# customers have there own SQL server and we must make it work',
 'Elasticsearch (not a database, so much so an indexing engine)',
 'SAP HANA (yep, "SAP" doesnt tell it enough)',
 'HANA (SAP is also MAXDATA and few others)',
 'Sybase (only with a gun to my head)',
 'This is embarrassing: Pervasive SQL',
 'Various AWS flavors of db services',
 'Azure SQL DW and Azure DocumentDB',
 'Sybase Adaptive Server Enterprise',
 'Too identifying/specific to list',
 'MS SQL Server on Azure IaaS VM',
 'Application Insights Analytics',
 'Some old dbs file system shit',
 'Netezza - built on PostGreSQL',
 'Apache Delta Lake / Parquett',
 "Ignition's internal database",
 'Hadoop based data structures',
 'Parallel DataWarehouse / APS',
 'Data General ISAM Databases',
 'Azure SQL Managed Instance',
 'Azure SQL DB (any flavor)',
 'Tibco Data Virtualization',
 'SAP MaxDB and Sybase ASE',
 'Azure SQL data warehouse',
 'Azure SQL Data Warehouse',
 'Cisco Information Server',
 'Azure Sql Data Warehouse',
 "Informix - but it's crap",
 'Microsoft Visual FoxPro',
 'Hadoop/Hive/HBASE/Kylin',
 'Parallel Data Warehouse',
 'Azure SQL Datawarehouse',
 'Sybase Advantage Server',
 'Sybase/SAP SQL Anywhere',
 'Google database service',
 'Cloudera Hadoop / Hive',
 'SQL Server on Azure VM',
 'Hadoop (HBase,etc...)',
 'SQL Anywhere - Sybase',
 'Proprietary flat file',
 'Google Cloud Platform',
 'SingleStore (MemSQL)',
 'Azure Data Warehouse',
 'Informix IDS and XPS',
 'Sybase SQL Anywhere',
 'Hadoop/SPARK on EMR',
 'SYBase SQL Anywhere',
 'Red Brick Warehouse',
 'Azure Data Explorer',
 'sybase sql anywhere',
 'FoxPro and Firebolt',
 'Azure SQL Analytics',
 'InterBase/FireBird',
 'Intersystems Cache',
 'Sybase,Adabas,IDMS',
 'InterSystems Cache',
 'Advantage Database',
 'IDMS/R (mainframe)',
 'Sybase. Ne really.',
 'IBM Netezza (bleh)',
 'both Azure and AWS',
 'InterSystems CachÃ©',
 'Sybase SQLAnywhere',
 'Analysis Services',
 'Intersystem Cache',
 'Infodata  SQLBase',
 'Progress OpenEdge',
 'Hadoop/hive/hbase',
 'OpenEdge Progress',
 'SAP SQL Anywhere',
 'Google Cloud SQL',
 'Hyperion Essbase',
 'Hyperion/Essbase',
 'Google big query',
 'Apache Spark SQL',
 'Borland DBase IV',
 'Google Big Query',
 'Unisys Mainframe',
 'Sybase Progress',
 'Pick / UniVerse',
 'Google bigquery',
 'SQL Anywhere 12',
 'UniVerse (Pick)',
 'Azure data lake',
 'Amazon Redshift',
 'Azure Data Lake',
 'Power bi / ssas',
 'sybase and Unix',
 'Amazon DynamoDB',
 'Google BigQuery',
 'too identifying',
 'Hive and HBase',
 'Dbase / Foxpro',
 'Natural ADABAS',
 'Progress [eb2]',
 'Big Data stack',
 'SAP Sybase ASE',
 'Google Spanner',
 'MS DocumentDB',
 'ElasticSearch',
 'Microsofy APS',
 'elasticsearch',
 'Unisys DMS II',
 'Apache Ignite',
 'Visual FoxPro',
 'Microsoft APS',
 'GCP Datastore',
 'Pervasive SQL',
 'SAP/Sybase IQ',
 'IIBM Informix',
 'FileMaker Pro',
 'Hadoop/Impala',
 'Azure Synapse',
 'Sybase SQL IQ',
 'Google cloud',
 'AWS redshift',
 'IBM Informix',
 'EnterpriseDB',
 'Microsoft CE',
 'Blob Storage',
 'Apache Spark',
 'S3 Data lake',
 'Azure Tables',
 'Azure SQL DW',
 'SQL Anywhere',
 'Apache Derby',
 'PROGRESS 4GL',
 'AWS Redshift',
 'AWS Netptune',
 'Informix IDS',
 'informatica',
 'Hadoop/Hive',
 'FoxPro 2.5B',
 'SAP S4/HANA',
 'Yellowbrick',
 'IBM Netezza',
 'iSeries DB2',
 'Apache Hive',
 'SqlAnywhere',
 'DataBricks',
 'Oracle RDB',
 'BerkeleyDB',
 'CA-datacom',
 'Sybase SQL',
 'ClickHouse',
 'CA-Datacom',
 'salesforce',
 'DocumentDB',
 'AWS Athena',
 'UNISYS DMS',
 'HP Vertica',
 'Clickhouse',
 'Sybase ASE',
 'Salesforce',
 'couch base',
 'Postgresql',
 'Powershell',
 'AWS Aurora',
 'IBM domino',
 'Databricks',
 'Data Lakes',
 'Dell Boomi',
 'sybase ASE',
 'Interbase',
 'Greenplum',
 'IBM AS400',
 'greenplum',
 'IMS DB/DC',
 'SyBase IQ',
 '4D Server',
 'FileMaker',
 'Couchbase',
 'Marklogic',
 'CouchBase',
 'Cockroach',
 'MarkLogic',
 'spark sql',
 'Cache,IBM',
 'Fasttrack',
 'couchbase',
 'Advantage',
 'AlphaFour',
 'Cosmos DB',
 'ExtremeDB',
 'HP Tandem',
 'HDInsight',
 'homegrown',
 'Pervasive',
 'snowflake',
 'pervasive',
 'Sybase IQ',
 'Snowflake',
 'Altibase',
 'Informix',
 'DynamoDB',
 'InfluxDB',
 'ArangoDB',
 'BigQuery',
 'progress',
 'Redshift',
 'Imfluxdb',
 'FireBird',
 'Progress',
 'redshift',
 'Influxdb',
 'SybaseIQ',
 'DynamoBD',
 'Firebird',
 'DataEase',
 'OrientDB',
 'Cloudera',
 'Raven DB',
 'DataFlex',
 'RedShift',
 'SAP HANA',
 'Kinetica',
 'Clustrix',
 'UniVerse',
 'Providex',
 'Azure DW',
 'firebird',
 'Dynamodb',
 'informix',
 'SQL Base',
 'Dataflex',
 'OpenEdge',
 'CosmosDB',
 'GraphDB',
 'SAP 300',
 'Couchdb',
 'netezza',
 'CA-IDMS',
 'RocksDB',
 'Elastic',
 'vertica',
 'Multics',
 'IBM DB2',
 'Clipper',
 'unidata',
 'Unidata',
 'BTRIEVE',
 'MonetDB',
 'DerbyDB',
 'CouchDB',
 'RavenDB',
 'Symitar',
 'CosmoDB',
 'CouchDb',
 'Vertica',
 'Datacom',
 'Paradox',
 'M/Cache',
 'Ingress',
 'Essbase',
 'Btrieve',
 'dbVista',
 'Netezza',
 'DBase 3',
 'DB2 400',
 'CoachDB',
 'SAP ASE',
 'RavenDb',
 'SQLBase',
 'MariaDB',
 'Adabas',
 'Dynamo',
 'WinSQL',
 'Actian',
 'dBaseX',
 'ingres',
 'Aurora',
 'Foxpro',
 'Access',
 'AS 400',
 'foxpro',
 'Hadoop',
 'MemSql',
 'Cosmos',
 'LiteDB',
 'Ingres',
 'Mx/SQL',
 'Exasol',
 'Citrix',
 'adabas',
 'SAP IQ',
 'FoxPro',
 'Presto',
 'Impala',
 'MemSQL',
 'Unisys',
 'sybase',
 'ADABAS',
 'Memsql',
 'Sybase',
 'Splunk',
 'INGRES',
 'hadoop',
 'SyBase',
 'MS APS',
 'CACHE',
 'Druid',
 'MUMPS',
 'Excel',
 'neo4j',
 'Couch',
 'AS400',
 'CachÃ©',
 'DBase',
 'Cache',
 'Dbase',
 'HBase',
 'Neo4j',
 'Neo4J',
 'Mysql',
 'MySQL',
 'Raven',
 'redis',
 'Spark',
 'Redis',
 'SCADA',
 'Focus',
 'dBase',
 'Kafka',
 'as400',
 'Rbase',
 'HBASE',
 'MAPR',
 'PICK',
 'LLAP',
 'SOLR',
 'SSRS',
 'RDMS',
 'Hana',
 'IDMS',
 'Riak',
 'None',
 'hive',
 'HANA',
 'Epic',
 'HPCC',
 'Hdfs',
 'Kudu',
 'JADE',
 'JSON',
 'Solr',
 'Hive',
 'HIVE',
 'DB3',
 'APS',
 'GBQ',
 'TM1',
 'QIX',
 'Udb',
 'rdb',
 'GCP',
 'SAS',
 'ASE',
 'DB4',
 'IMS',
 '4D',
 'H2',
 'Gp',
 'T',
 'M']

In [24]:
table_db2 = pd.DataFrame()
table_db2["db_name"]=new_dbs
table_db2["db_id"]=np.nan

db = pd.read_sql_query("SELECT * FROM db", survey)

                           db_name  db_id
10  MS SQL Server on Azure IaaS VM    NaN
11  Application Insights Analytics    NaN
12   Some old dbs file system shit    NaN
13   Netezza - built on PostGreSQL    NaN
14    Apache Delta Lake / Parquett    NaN
15    Ignition's internal database    NaN
16    Hadoop based data structures    NaN
17    Parallel DataWarehouse / APS    NaN
18     Data General ISAM Databases    NaN
19      Azure SQL Managed Instance    NaN
20       Azure SQL DB (any flavor)    NaN
21       Tibco Data Virtualization    NaN
22        SAP MaxDB and Sybase ASE    NaN
23        Azure SQL data warehouse    NaN
24        Azure SQL Data Warehouse    NaN
25        Cisco Information Server    NaN
26        Azure Sql Data Warehouse    NaN
27        Informix - but it's crap    NaN
28         Microsoft Visual FoxPro    NaN
29         Hadoop/Hive/HBASE/Kylin    NaN
30         Parallel Data Warehouse    NaN
31         Azure SQL Datawarehouse    NaN
32         Sybase Advantage Server    NaN
33         Sybase/SAP SQL Anywhere    NaN
34         Google database service    NaN
35          Cloudera Hadoop / Hive    NaN
36          SQL Server on Azure VM    NaN
37           Hadoop (HBase,etc...)    NaN
38           SQL Anywhere - Sybase    NaN
39           Proprietary flat file    NaN

In [22]:
# table_db2.to_sql('db', if_exists='append', con=survey, index=False)

In [61]:
data = pd.read_excel("jeux_donnees/Data_Professional_Salary_Survey_Responses_1.xlsx")
data["HowManyCompanies"]=data["HowManyCompanies"].apply(str)

sondage_item = pd.read_sql_query("SELECT * FROM sondage_item", survey)
db = pd.read_sql_query("SELECT * FROM db", survey)
db.index = db['db_name'].str.len()
db = db.sort_index(ascending=False).reset_index(drop=True)
db

     db_id                                            db_name
0       16  foxpro developer with c# customers have there ...
1       17  Elasticsearch (not a database, so much so an i...
2       18        SAP HANA (yep, "SAP" doesnt tell it enough)
3       19          HANA (SAP is also MAXDATA and few others)
4       21                This is embarrassing: Pervasive SQL
..     ...                                                ...
374    375                                                 4D
375    376                                                 H2
376    377                                                 Gp
377    378                                                  T
378    379                                                  M

[379 rows x 2 columns]

In [58]:
pd.options.mode.chained_assignment = None

def trouver_index(valeur, table):
    return int(table[table.columns[0]][(table[table.columns[1]]==valeur)==True])

l=[]

for i in range(len(sondage_item)):
    if type(data["OtherDatabases"][i]) != str :
        l.append(["Not Asked"])
    else :
        ldb=[]
        for j in db["db_name"]:
            if j in data["OtherDatabases"][i]:
                ldb.append(j)
                data["OtherDatabases"][i] = data["OtherDatabases"][i].replace(j," ")
        l.append(ldb)

liste_sgi_id = []
liste_dbs = []

for i in range(len(l)):
    for j in l[i] :
        liste_sgi_id.append(sondage_item["sgi_id"][i])
        liste_dbs.append(j)

df_other_databases = pd.DataFrame()
df_other_databases["sgi_id"] = liste_sgi_id
df_other_databases["db_id"] = liste_dbs

for i in df_other_databases.index:
    if df_other_databases["db_id"][i] == "Not Asked" :
        df_other_databases = df_other_databases.drop([i])
    else:
        df_other_databases["db_id"][i] = trouver_index(df_other_databases["db_id"][i], db)

In [71]:
df_other_databases

       sgi_id db_id
0       44938     1
1       44939    36
2       44940    36
3       44940     2
4       44941    36
...       ...   ...
23258   55276     6
23259   55277     7
23260   55278     5
23261   55278     2
23262   55278    10

[21319 rows x 2 columns]

In [74]:
df_other_databases.to_sql('other_database', if_exists='append', con=survey, index=False)